{
  "added_tokens_decoder": {
    "0": {
      "content": "<|padding|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "1": {
      "content": "<|endoftext|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "2": {
      "content": "<|unk|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    }
  },
  "backend": "custom",
  "box_labels": [],
  "eos_token": "<|endoftext|>",
  "loss_weights": {
    "Ġ<": 7.0,
    "Ġ<0>": 2.0,
    "Ġ<100>": 2.0,
    "Ġ<101>": 2.0,
    "Ġ<102>": 2.0,
    "Ġ<103>": 2.0,
    "Ġ<104>": 2.0,
    "Ġ<105>": 2.0,
    "Ġ<106>": 2.0,
    "Ġ<107>": 2.0,
    "Ġ<108>": 2.0,
    "Ġ<109>": 2.0,
    "Ġ<10>": 2.0,
    "Ġ<110>": 2.0,
    "Ġ<111>": 2.0,
    "Ġ<112>": 2.0,
    "Ġ<113>": 2.0,
    "Ġ<114>": 2.0,
    "Ġ<115>": 2.0,
    "Ġ<116>": 2.0,
    "Ġ<117>": 2.0,
    "Ġ<118>": 2.0,
    "Ġ<119>": 2.0,
    "Ġ<11>": 2.0,
    "Ġ<120>": 2.0,
    "Ġ<121>": 2.0,
    "Ġ<122>": 2.0,
    "Ġ<123>": 2.0,
    "Ġ<124>": 2.0,
    "Ġ<125>": 2.0,
    "Ġ<126>": 2.0,
    "Ġ<127>": 2.0,
    "Ġ<128>": 2.0,
    "Ġ<129>": 2.0,
    "Ġ<12>": 2.0,
    "Ġ<130>": 2.0,
    "Ġ<131>": 2.0,
    "Ġ<132>": 2.0,
    "Ġ<133>": 2.0,
    "Ġ<134>": 2.0,
    "Ġ<135>": 2.0,
    "Ġ<136>": 2.0,
    "Ġ<137>": 2.0,
    "Ġ<138>": 2.0,
    "Ġ<139>": 2.0,
    "Ġ<13>": 2.0,
    "Ġ<140>": 2.0,
    "Ġ<141>": 2.0,
    "Ġ<142>": 2.0,
    "Ġ<143>": 2.0,
    "Ġ<144>": 2.0,
    "Ġ<145>": 2.0,
    "Ġ<146>": 2.0,
    "Ġ<147>": 2.0,
    "Ġ<148>": 2.0,
    "Ġ<149>": 2.0,
    "Ġ<14>": 2.0,
    "Ġ<150>": 2.0,
    "Ġ<151>": 2.0,
    "Ġ<152>": 2.0,
    "Ġ<153>": 2.0,
    "Ġ<154>": 2.0,
    "Ġ<155>": 2.0,
    "Ġ<156>": 2.0,
    "Ġ<157>": 2.0,
    "Ġ<158>": 2.0,
    "Ġ<159>": 2.0,
    "Ġ<15>": 2.0,
    "Ġ<160>": 2.0,
    "Ġ<161>": 2.0,
    "Ġ<162>": 2.0,
    "Ġ<163>": 2.0,
    "Ġ<164>": 2.0,
    "Ġ<165>": 2.0,
    "Ġ<166>": 2.0,
    "Ġ<167>": 2.0,
    "Ġ<168>": 2.0,
    "Ġ<169>": 2.0,
    "Ġ<16>": 2.0,
    "Ġ<170>": 2.0,
    "Ġ<171>": 2.0,
    "Ġ<172>": 2.0,
    "Ġ<173>": 2.0,
    "Ġ<174>": 2.0,
    "Ġ<175>": 2.0,
    "Ġ<176>": 2.0,
    "Ġ<177>": 2.0,
    "Ġ<178>": 2.0,
    "Ġ<179>": 2.0,
    "Ġ<17>": 2.0,
    "Ġ<180>": 2.0,
    "Ġ<181>": 2.0,
    "Ġ<182>": 2.0,
    "Ġ<183>": 2.0,
    "Ġ<184>": 2.0,
    "Ġ<185>": 2.0,
    "Ġ<186>": 2.0,
    "Ġ<187>": 2.0,
    "Ġ<188>": 2.0,
    "Ġ<189>": 2.0,
    "Ġ<18>": 2.0,
    "Ġ<190>": 2.0,
    "Ġ<191>": 2.0,
    "Ġ<192>": 2.0,
    "Ġ<193>": 2.0,
    "Ġ<194>": 2.0,
    "Ġ<195>": 2.0,
    "Ġ<196>": 2.0,
    "Ġ<197>": 2.0,
    "Ġ<198>": 2.0,
    "Ġ<199>": 2.0,
    "Ġ<19>": 2.0,
    "Ġ<1>": 2.0,
    "Ġ<200>": 2.0,
    "Ġ<201>": 2.0,
    "Ġ<202>": 2.0,
    "Ġ<203>": 2.0,
    "Ġ<204>": 2.0,
    "Ġ<205>": 2.0,
    "Ġ<206>": 2.0,
    "Ġ<207>": 2.0,
    "Ġ<208>": 2.0,
    "Ġ<209>": 2.0,
    "Ġ<20>": 2.0,
    "Ġ<210>": 2.0,
    "Ġ<211>": 2.0,
    "Ġ<212>": 2.0,
    "Ġ<213>": 2.0,
    "Ġ<214>": 2.0,
    "Ġ<215>": 2.0,
    "Ġ<216>": 2.0,
    "Ġ<217>": 2.0,
    "Ġ<218>": 2.0,
    "Ġ<219>": 2.0,
    "Ġ<21>": 2.0,
    "Ġ<220>": 2.0,
    "Ġ<221>": 2.0,
    "Ġ<222>": 2.0,
    "Ġ<223>": 2.0,
    "Ġ<224>": 2.0,
    "Ġ<225>": 2.0,
    "Ġ<226>": 2.0,
    "Ġ<227>": 2.0,
    "Ġ<228>": 2.0,
    "Ġ<229>": 2.0,
    "Ġ<22>": 2.0,
    "Ġ<230>": 2.0,
    "Ġ<231>": 2.0,
    "Ġ<232>": 2.0,
    "Ġ<233>": 2.0,
    "Ġ<234>": 2.0,
    "Ġ<235>": 2.0,
    "Ġ<236>": 2.0,
    "Ġ<237>": 2.0,
    "Ġ<238>": 2.0,
    "Ġ<239>": 2.0,
    "Ġ<23>": 2.0,
    "Ġ<240>": 2.0,
    "Ġ<241>": 2.0,
    "Ġ<242>": 2.0,
    "Ġ<243>": 2.0,
    "Ġ<244>": 2.0,
    "Ġ<245>": 2.0,
    "Ġ<246>": 2.0,
    "Ġ<247>": 2.0,
    "Ġ<248>": 2.0,
    "Ġ<249>": 2.0,
    "Ġ<24>": 2.0,
    "Ġ<250>": 2.0,
    "Ġ<251>": 2.0,
    "Ġ<252>": 2.0,
    "Ġ<253>": 2.0,
    "Ġ<254>": 2.0,
    "Ġ<255>": 2.0,
    "Ġ<256>": 2.0,
    "Ġ<257>": 2.0,
    "Ġ<258>": 2.0,
    "Ġ<259>": 2.0,
    "Ġ<25>": 2.0,
    "Ġ<260>": 2.0,
    "Ġ<261>": 2.0,
    "Ġ<262>": 2.0,
    "Ġ<263>": 2.0,
    "Ġ<264>": 2.0,
    "Ġ<265>": 2.0,
    "Ġ<266>": 2.0,
    "Ġ<267>": 2.0,
    "Ġ<268>": 2.0,
    "Ġ<269>": 2.0,
    "Ġ<26>": 2.0,
    "Ġ<270>": 2.0,
    "Ġ<271>": 2.0,
    "Ġ<272>": 2.0,
    "Ġ<273>": 2.0,
    "Ġ<274>": 2.0,
    "Ġ<275>": 2.0,
    "Ġ<276>": 2.0,
    "Ġ<277>": 2.0,
    "Ġ<278>": 2.0,
    "Ġ<279>": 2.0,
    "Ġ<27>": 2.0,
    "Ġ<280>": 2.0,
    "Ġ<281>": 2.0,
    "Ġ<282>": 2.0,
    "Ġ<283>": 2.0,
    "Ġ<284>": 2.0,
    "Ġ<285>": 2.0,
    "Ġ<286>": 2.0,
    "Ġ<287>": 2.0,
    "Ġ<288>": 2.0,
    "Ġ<289>": 2.0,
    "Ġ<28>": 2.0,
    "Ġ<290>": 2.0,
    "Ġ<291>": 2.0,
    "Ġ<292>": 2.0,
    "Ġ<293>": 2.0,
    "Ġ<294>": 2.0,
    "Ġ<295>": 2.0,
    "Ġ<296>": 2.0,
    "Ġ<297>": 2.0,
    "Ġ<298>": 2.0,
    "Ġ<299>": 2.0,
    "Ġ<29>": 2.0,
    "Ġ<2>": 2.0,
    "Ġ<300>": 2.0,
    "Ġ<301>": 2.0,
    "Ġ<302>": 2.0,
    "Ġ<303>": 2.0,
    "Ġ<304>": 2.0,
    "Ġ<305>": 2.0,
    "Ġ<306>": 2.0,
    "Ġ<307>": 2.0,
    "Ġ<308>": 2.0,
    "Ġ<309>": 2.0,
    "Ġ<30>": 2.0,
    "Ġ<310>": 2.0,
    "Ġ<311>": 2.0,
    "Ġ<312>": 2.0,
    "Ġ<313>": 2.0,
    "Ġ<314>": 2.0,
    "Ġ<315>": 2.0,
    "Ġ<316>": 2.0,
    "Ġ<317>": 2.0,
    "Ġ<318>": 2.0,
    "Ġ<319>": 2.0,
    "Ġ<31>": 2.0,
    "Ġ<320>": 2.0,
    "Ġ<321>": 2.0,
    "Ġ<322>": 2.0,
    "Ġ<323>": 2.0,
    "Ġ<324>": 2.0,
    "Ġ<325>": 2.0,
    "Ġ<326>": 2.0,
    "Ġ<327>": 2.0,
    "Ġ<328>": 2.0,
    "Ġ<329>": 2.0,
    "Ġ<32>": 2.0,
    "Ġ<330>": 2.0,
    "Ġ<331>": 2.0,
    "Ġ<332>": 2.0,
    "Ġ<333>": 2.0,
    "Ġ<334>": 2.0,
    "Ġ<335>": 2.0,
    "Ġ<336>": 2.0,
    "Ġ<337>": 2.0,
    "Ġ<338>": 2.0,
    "Ġ<339>": 2.0,
    "Ġ<33>": 2.0,
    "Ġ<340>": 2.0,
    "Ġ<341>": 2.0,
    "Ġ<342>": 2.0,
    "Ġ<343>": 2.0,
    "Ġ<344>": 2.0,
    "Ġ<345>": 2.0,
    "Ġ<346>": 2.0,
    "Ġ<347>": 2.0,
    "Ġ<348>": 2.0,
    "Ġ<349>": 2.0,
    "Ġ<34>": 2.0,
    "Ġ<350>": 2.0,
    "Ġ<351>": 2.0,
    "Ġ<352>": 2.0,
    "Ġ<353>": 2.0,
    "Ġ<354>": 2.0,
    "Ġ<355>": 2.0,
    "Ġ<356>": 2.0,
    "Ġ<357>": 2.0,
    "Ġ<358>": 2.0,
    "Ġ<359>": 2.0,
    "Ġ<35>": 2.0,
    "Ġ<360>": 2.0,
    "Ġ<361>": 2.0,
    "Ġ<362>": 2.0,
    "Ġ<363>": 2.0,
    "Ġ<364>": 2.0,
    "Ġ<365>": 2.0,
    "Ġ<366>": 2.0,
    "Ġ<367>": 2.0,
    "Ġ<368>": 2.0,
    "Ġ<369>": 2.0,
    "Ġ<36>": 2.0,
    "Ġ<370>": 2.0,
    "Ġ<371>": 2.0,
    "Ġ<372>": 2.0,
    "Ġ<373>": 2.0,
    "Ġ<374>": 2.0,
    "Ġ<375>": 2.0,
    "Ġ<376>": 2.0,
    "Ġ<377>": 2.0,
    "Ġ<378>": 2.0,
    "Ġ<379>": 2.0,
    "Ġ<37>": 2.0,
    "Ġ<380>": 2.0,
    "Ġ<381>": 2.0,
    "Ġ<382>": 2.0,
    "Ġ<383>": 2.0,
    "Ġ<384>": 2.0,
    "Ġ<385>": 2.0,
    "Ġ<386>": 2.0,
    "Ġ<387>": 2.0,
    "Ġ<388>": 2.0,
    "Ġ<389>": 2.0,
    "Ġ<38>": 2.0,
    "Ġ<390>": 2.0,
    "Ġ<391>": 2.0,
    "Ġ<392>": 2.0,
    "Ġ<393>": 2.0,
    "Ġ<394>": 2.0,
    "Ġ<395>": 2.0,
    "Ġ<396>": 2.0,
    "Ġ<397>": 2.0,
    "Ġ<398>": 2.0,
    "Ġ<399>": 2.0,
    "Ġ<39>": 2.0,
    "Ġ<3>": 2.0,
    "Ġ<40>": 2.0,
    "Ġ<41>": 2.0,
    "Ġ<42>": 2.0,
    "Ġ<43>": 2.0,
    "Ġ<44>": 2.0,
    "Ġ<45>": 2.0,
    "Ġ<46>": 2.0,
    "Ġ<47>": 2.0,
    "Ġ<48>": 2.0,
    "Ġ<49>": 2.0,
    "Ġ<4>": 2.0,
    "Ġ<50>": 2.0,
    "Ġ<51>": 2.0,
    "Ġ<52>": 2.0,
    "Ġ<53>": 2.0,
    "Ġ<54>": 2.0,
    "Ġ<55>": 2.0,
    "Ġ<56>": 2.0,
    "Ġ<57>": 2.0,
    "Ġ<58>": 2.0,
    "Ġ<59>": 2.0,
    "Ġ<5>": 2.0,
    "Ġ<60>": 2.0,
    "Ġ<61>": 2.0,
    "Ġ<62>": 2.0,
    "Ġ<63>": 2.0,
    "Ġ<64>": 2.0,
    "Ġ<65>": 2.0,
    "Ġ<66>": 2.0,
    "Ġ<67>": 2.0,
    "Ġ<68>": 2.0,
    "Ġ<69>": 2.0,
    "Ġ<6>": 2.0,
    "Ġ<70>": 2.0,
    "Ġ<71>": 2.0,
    "Ġ<72>": 2.0,
    "Ġ<73>": 2.0,
    "Ġ<74>": 2.0,
    "Ġ<75>": 2.0,
    "Ġ<76>": 2.0,
    "Ġ<77>": 2.0,
    "Ġ<78>": 2.0,
    "Ġ<79>": 2.0,
    "Ġ<7>": 2.0,
    "Ġ<80>": 2.0,
    "Ġ<81>": 2.0,
    "Ġ<82>": 2.0,
    "Ġ<83>": 2.0,
    "Ġ<84>": 2.0,
    "Ġ<85>": 2.0,
    "Ġ<86>": 2.0,
    "Ġ<87>": 2.0,
    "Ġ<88>": 2.0,
    "Ġ<89>": 2.0,
    "Ġ<8>": 2.0,
    "Ġ<90>": 2.0,
    "Ġ<91>": 2.0,
    "Ġ<92>": 2.0,
    "Ġ<93>": 2.0,
    "Ġ<94>": 2.0,
    "Ġ<95>": 2.0,
    "Ġ<96>": 2.0,
    "Ġ<97>": 2.0,
    "Ġ<98>": 2.0,
    "Ġ<99>": 2.0,
    "Ġ<9>": 2.0,
    "Ġ==": 7.0,
    "Ġ>": 7.0,
    "ĠA": 7.0,
    "ĠB": 7.0,
    "ĠC": 7.0,
    "ĠD": 7.0,
    "ĠE": 7.0
  },
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "<|padding|>",
  "tokenizer_class": "AlgorithmicTaskTokenizer",
  "unk_token": "<|unk|>"
}
