{
  "<|padding|>": 0,
  "<|endoftext|>": 1,
  "<|unk|>": 2,
  "Ġinit": 3,
  "Ġoperation": 4,
  "Ġswap": 5,
  "Ġwrite": 6,
  "Ġend": 7,
  "Ġload": 8,
  "Ġline": 9,
  "Ġtape": 10,
  "Ġ.": 11,
  "ĠCat": 12,
  "ĠDog": 13,
  "ĠApple": 14,
  "ĠBook": 15,
  "ĠHat": 16,
  "ĠA": 17,
  "ĠB": 18,
  "ĠC": 19,
  "ĠD": 20,
  "ĠE": 21,
  "ĠK_A": 22,
  "ĠK_B": 23,
  "ĠK_C": 24,
  "ĠK_D": 25,
  "ĠK_E": 26,
  "ĠW_A": 27,
  "ĠW_B": 28,
  "ĠW_C": 29,
  "ĠW_D": 30,
  "ĠW_E": 31,
  "ĠCat_Dog": 32,
  "ĠDog_Cat": 33,
  "Ġ==": 34,
  "Ġ>": 35,
  "Ġ<": 36,
  "Ġ<A>": 37,
  "Ġ<B>": 38,
  "Ġ<C>": 39,
  "Ġ<D>": 40,
  "Ġ<E>": 41,
  "ĠIN": 42,
  "ĠOUT": 43,
  "Ġres": 44,
  "Ġfinal": 45,
  "Ġ<|trace|>": 46,
  "Ġanswer": 47,
  "Ġ<0>": 48,
  "Ġ<1>": 49,
  "Ġ<2>": 50,
  "Ġ<3>": 51,
  "Ġ<4>": 52,
  "Ġ<5>": 53,
  "Ġ<6>": 54,
  "Ġ<7>": 55,
  "Ġ<8>": 56,
  "Ġ<9>": 57,
  "Ġ<10>": 58,
  "Ġ<11>": 59,
  "Ġ<12>": 60,
  "Ġ<13>": 61,
  "Ġ<14>": 62,
  "Ġ<15>": 63,
  "Ġ<16>": 64,
  "Ġ<17>": 65,
  "Ġ<18>": 66,
  "Ġ<19>": 67,
  "Ġ<20>": 68,
  "Ġ<21>": 69,
  "Ġ<22>": 70,
  "Ġ<23>": 71,
  "Ġ<24>": 72,
  "Ġ<25>": 73,
  "Ġ<26>": 74,
  "Ġ<27>": 75,
  "Ġ<28>": 76,
  "Ġ<29>": 77,
  "Ġ<30>": 78,
  "Ġ<31>": 79,
  "Ġ<32>": 80,
  "Ġ<33>": 81,
  "Ġ<34>": 82,
  "Ġ<35>": 83,
  "Ġ<36>": 84,
  "Ġ<37>": 85,
  "Ġ<38>": 86,
  "Ġ<39>": 87,
  "Ġ<40>": 88,
  "Ġ<41>": 89,
  "Ġ<42>": 90,
  "Ġ<43>": 91,
  "Ġ<44>": 92,
  "Ġ<45>": 93,
  "Ġ<46>": 94,
  "Ġ<47>": 95,
  "Ġ<48>": 96,
  "Ġ<49>": 97,
  "Ġ<50>": 98,
  "Ġ<51>": 99,
  "Ġ<52>": 100,
  "Ġ<53>": 101,
  "Ġ<54>": 102,
  "Ġ<55>": 103,
  "Ġ<56>": 104,
  "Ġ<57>": 105,
  "Ġ<58>": 106,
  "Ġ<59>": 107,
  "Ġ<60>": 108,
  "Ġ<61>": 109,
  "Ġ<62>": 110,
  "Ġ<63>": 111,
  "Ġ<64>": 112,
  "Ġ<65>": 113,
  "Ġ<66>": 114,
  "Ġ<67>": 115,
  "Ġ<68>": 116,
  "Ġ<69>": 117,
  "Ġ<70>": 118,
  "Ġ<71>": 119,
  "Ġ<72>": 120,
  "Ġ<73>": 121,
  "Ġ<74>": 122,
  "Ġ<75>": 123,
  "Ġ<76>": 124,
  "Ġ<77>": 125,
  "Ġ<78>": 126,
  "Ġ<79>": 127,
  "Ġ<80>": 128,
  "Ġ<81>": 129,
  "Ġ<82>": 130,
  "Ġ<83>": 131,
  "Ġ<84>": 132,
  "Ġ<85>": 133,
  "Ġ<86>": 134,
  "Ġ<87>": 135,
  "Ġ<88>": 136,
  "Ġ<89>": 137,
  "Ġ<90>": 138,
  "Ġ<91>": 139,
  "Ġ<92>": 140,
  "Ġ<93>": 141,
  "Ġ<94>": 142,
  "Ġ<95>": 143,
  "Ġ<96>": 144,
  "Ġ<97>": 145,
  "Ġ<98>": 146,
  "Ġ<99>": 147,
  "Ġ<100>": 148,
  "Ġ<101>": 149,
  "Ġ<102>": 150,
  "Ġ<103>": 151,
  "Ġ<104>": 152,
  "Ġ<105>": 153,
  "Ġ<106>": 154,
  "Ġ<107>": 155,
  "Ġ<108>": 156,
  "Ġ<109>": 157,
  "Ġ<110>": 158,
  "Ġ<111>": 159,
  "Ġ<112>": 160,
  "Ġ<113>": 161,
  "Ġ<114>": 162,
  "Ġ<115>": 163,
  "Ġ<116>": 164,
  "Ġ<117>": 165,
  "Ġ<118>": 166,
  "Ġ<119>": 167,
  "Ġ<120>": 168,
  "Ġ<121>": 169,
  "Ġ<122>": 170,
  "Ġ<123>": 171,
  "Ġ<124>": 172,
  "Ġ<125>": 173,
  "Ġ<126>": 174,
  "Ġ<127>": 175,
  "Ġ<128>": 176,
  "Ġ<129>": 177,
  "Ġ<130>": 178,
  "Ġ<131>": 179,
  "Ġ<132>": 180,
  "Ġ<133>": 181,
  "Ġ<134>": 182,
  "Ġ<135>": 183,
  "Ġ<136>": 184,
  "Ġ<137>": 185,
  "Ġ<138>": 186,
  "Ġ<139>": 187,
  "Ġ<140>": 188,
  "Ġ<141>": 189,
  "Ġ<142>": 190,
  "Ġ<143>": 191,
  "Ġ<144>": 192,
  "Ġ<145>": 193,
  "Ġ<146>": 194,
  "Ġ<147>": 195,
  "Ġ<148>": 196,
  "Ġ<149>": 197,
  "Ġ<150>": 198,
  "Ġ<151>": 199,
  "Ġ<152>": 200,
  "Ġ<153>": 201,
  "Ġ<154>": 202,
  "Ġ<155>": 203,
  "Ġ<156>": 204,
  "Ġ<157>": 205,
  "Ġ<158>": 206,
  "Ġ<159>": 207,
  "Ġ<160>": 208,
  "Ġ<161>": 209,
  "Ġ<162>": 210,
  "Ġ<163>": 211,
  "Ġ<164>": 212,
  "Ġ<165>": 213,
  "Ġ<166>": 214,
  "Ġ<167>": 215,
  "Ġ<168>": 216,
  "Ġ<169>": 217,
  "Ġ<170>": 218,
  "Ġ<171>": 219,
  "Ġ<172>": 220,
  "Ġ<173>": 221,
  "Ġ<174>": 222,
  "Ġ<175>": 223,
  "Ġ<176>": 224,
  "Ġ<177>": 225,
  "Ġ<178>": 226,
  "Ġ<179>": 227,
  "Ġ<180>": 228,
  "Ġ<181>": 229,
  "Ġ<182>": 230,
  "Ġ<183>": 231,
  "Ġ<184>": 232,
  "Ġ<185>": 233,
  "Ġ<186>": 234,
  "Ġ<187>": 235,
  "Ġ<188>": 236,
  "Ġ<189>": 237,
  "Ġ<190>": 238,
  "Ġ<191>": 239,
  "Ġ<192>": 240,
  "Ġ<193>": 241,
  "Ġ<194>": 242,
  "Ġ<195>": 243,
  "Ġ<196>": 244,
  "Ġ<197>": 245,
  "Ġ<198>": 246,
  "Ġ<199>": 247,
  "Ġ<200>": 248,
  "Ġ<201>": 249,
  "Ġ<202>": 250,
  "Ġ<203>": 251,
  "Ġ<204>": 252,
  "Ġ<205>": 253,
  "Ġ<206>": 254,
  "Ġ<207>": 255,
  "Ġ<208>": 256,
  "Ġ<209>": 257,
  "Ġ<210>": 258,
  "Ġ<211>": 259,
  "Ġ<212>": 260,
  "Ġ<213>": 261,
  "Ġ<214>": 262,
  "Ġ<215>": 263,
  "Ġ<216>": 264,
  "Ġ<217>": 265,
  "Ġ<218>": 266,
  "Ġ<219>": 267,
  "Ġ<220>": 268,
  "Ġ<221>": 269,
  "Ġ<222>": 270,
  "Ġ<223>": 271,
  "Ġ<224>": 272,
  "Ġ<225>": 273,
  "Ġ<226>": 274,
  "Ġ<227>": 275,
  "Ġ<228>": 276,
  "Ġ<229>": 277,
  "Ġ<230>": 278,
  "Ġ<231>": 279,
  "Ġ<232>": 280,
  "Ġ<233>": 281,
  "Ġ<234>": 282,
  "Ġ<235>": 283,
  "Ġ<236>": 284,
  "Ġ<237>": 285,
  "Ġ<238>": 286,
  "Ġ<239>": 287,
  "Ġ<240>": 288,
  "Ġ<241>": 289,
  "Ġ<242>": 290,
  "Ġ<243>": 291,
  "Ġ<244>": 292,
  "Ġ<245>": 293,
  "Ġ<246>": 294,
  "Ġ<247>": 295,
  "Ġ<248>": 296,
  "Ġ<249>": 297,
  "Ġ<250>": 298,
  "Ġ<251>": 299,
  "Ġ<252>": 300,
  "Ġ<253>": 301,
  "Ġ<254>": 302,
  "Ġ<255>": 303,
  "Ġ<256>": 304,
  "Ġ<257>": 305,
  "Ġ<258>": 306,
  "Ġ<259>": 307,
  "Ġ<260>": 308,
  "Ġ<261>": 309,
  "Ġ<262>": 310,
  "Ġ<263>": 311,
  "Ġ<264>": 312,
  "Ġ<265>": 313,
  "Ġ<266>": 314,
  "Ġ<267>": 315,
  "Ġ<268>": 316,
  "Ġ<269>": 317,
  "Ġ<270>": 318,
  "Ġ<271>": 319,
  "Ġ<272>": 320,
  "Ġ<273>": 321,
  "Ġ<274>": 322,
  "Ġ<275>": 323,
  "Ġ<276>": 324,
  "Ġ<277>": 325,
  "Ġ<278>": 326,
  "Ġ<279>": 327,
  "Ġ<280>": 328,
  "Ġ<281>": 329,
  "Ġ<282>": 330,
  "Ġ<283>": 331,
  "Ġ<284>": 332,
  "Ġ<285>": 333,
  "Ġ<286>": 334,
  "Ġ<287>": 335,
  "Ġ<288>": 336,
  "Ġ<289>": 337,
  "Ġ<290>": 338,
  "Ġ<291>": 339,
  "Ġ<292>": 340,
  "Ġ<293>": 341,
  "Ġ<294>": 342,
  "Ġ<295>": 343,
  "Ġ<296>": 344,
  "Ġ<297>": 345,
  "Ġ<298>": 346,
  "Ġ<299>": 347,
  "Ġ<300>": 348,
  "Ġ<301>": 349,
  "Ġ<302>": 350,
  "Ġ<303>": 351,
  "Ġ<304>": 352,
  "Ġ<305>": 353,
  "Ġ<306>": 354,
  "Ġ<307>": 355,
  "Ġ<308>": 356,
  "Ġ<309>": 357,
  "Ġ<310>": 358,
  "Ġ<311>": 359,
  "Ġ<312>": 360,
  "Ġ<313>": 361,
  "Ġ<314>": 362,
  "Ġ<315>": 363,
  "Ġ<316>": 364,
  "Ġ<317>": 365,
  "Ġ<318>": 366,
  "Ġ<319>": 367,
  "Ġ<320>": 368,
  "Ġ<321>": 369,
  "Ġ<322>": 370,
  "Ġ<323>": 371,
  "Ġ<324>": 372,
  "Ġ<325>": 373,
  "Ġ<326>": 374,
  "Ġ<327>": 375,
  "Ġ<328>": 376,
  "Ġ<329>": 377,
  "Ġ<330>": 378,
  "Ġ<331>": 379,
  "Ġ<332>": 380,
  "Ġ<333>": 381,
  "Ġ<334>": 382,
  "Ġ<335>": 383,
  "Ġ<336>": 384,
  "Ġ<337>": 385,
  "Ġ<338>": 386,
  "Ġ<339>": 387,
  "Ġ<340>": 388,
  "Ġ<341>": 389,
  "Ġ<342>": 390,
  "Ġ<343>": 391,
  "Ġ<344>": 392,
  "Ġ<345>": 393,
  "Ġ<346>": 394,
  "Ġ<347>": 395,
  "Ġ<348>": 396,
  "Ġ<349>": 397,
  "Ġ<350>": 398,
  "Ġ<351>": 399,
  "Ġ<352>": 400,
  "Ġ<353>": 401,
  "Ġ<354>": 402,
  "Ġ<355>": 403,
  "Ġ<356>": 404,
  "Ġ<357>": 405,
  "Ġ<358>": 406,
  "Ġ<359>": 407,
  "Ġ<360>": 408,
  "Ġ<361>": 409,
  "Ġ<362>": 410,
  "Ġ<363>": 411,
  "Ġ<364>": 412,
  "Ġ<365>": 413,
  "Ġ<366>": 414,
  "Ġ<367>": 415,
  "Ġ<368>": 416,
  "Ġ<369>": 417,
  "Ġ<370>": 418,
  "Ġ<371>": 419,
  "Ġ<372>": 420,
  "Ġ<373>": 421,
  "Ġ<374>": 422,
  "Ġ<375>": 423,
  "Ġ<376>": 424,
  "Ġ<377>": 425,
  "Ġ<378>": 426,
  "Ġ<379>": 427,
  "Ġ<380>": 428,
  "Ġ<381>": 429,
  "Ġ<382>": 430,
  "Ġ<383>": 431,
  "Ġ<384>": 432,
  "Ġ<385>": 433,
  "Ġ<386>": 434,
  "Ġ<387>": 435,
  "Ġ<388>": 436,
  "Ġ<389>": 437,
  "Ġ<390>": 438,
  "Ġ<391>": 439,
  "Ġ<392>": 440,
  "Ġ<393>": 441,
  "Ġ<394>": 442,
  "Ġ<395>": 443,
  "Ġ<396>": 444,
  "Ġ<397>": 445,
  "Ġ<398>": 446,
  "Ġ<399>": 447
}