{
  "<|padding|>": 0,
  "<|endoftext|>": 1,
  "<|unk|>": 2,
  "Ġinit": 3,
  "Ġoperation": 4,
  "Ġswap": 5,
  "Ġwrite": 6,
  "Ġend": 7,
  "Ġload": 8,
  "Ġline": 9,
  "Ġtape": 10,
  "Ġ.": 11,
  "Ġ0": 12,
  "Ġ1": 13,
  "ĠE": 14,
  "ĠO": 15,
  "Ġ<|trace|>": 16,
  "Ġanswer": 17,
  "Ġ<0>": 18,
  "Ġ<1>": 19,
  "Ġ<2>": 20,
  "Ġ<3>": 21,
  "Ġ<4>": 22,
  "Ġ<5>": 23,
  "Ġ<6>": 24,
  "Ġ<7>": 25,
  "Ġ<8>": 26,
  "Ġ<9>": 27,
  "Ġ<10>": 28,
  "Ġ<11>": 29,
  "Ġ<12>": 30,
  "Ġ<13>": 31,
  "Ġ<14>": 32,
  "Ġ<15>": 33,
  "Ġ<16>": 34,
  "Ġ<17>": 35,
  "Ġ<18>": 36,
  "Ġ<19>": 37,
  "Ġ<20>": 38,
  "Ġ<21>": 39,
  "Ġ<22>": 40,
  "Ġ<23>": 41,
  "Ġ<24>": 42,
  "Ġ<25>": 43,
  "Ġ<26>": 44,
  "Ġ<27>": 45,
  "Ġ<28>": 46,
  "Ġ<29>": 47,
  "Ġ<30>": 48,
  "Ġ<31>": 49,
  "Ġ<32>": 50,
  "Ġ<33>": 51,
  "Ġ<34>": 52,
  "Ġ<35>": 53,
  "Ġ<36>": 54,
  "Ġ<37>": 55,
  "Ġ<38>": 56,
  "Ġ<39>": 57,
  "Ġ<40>": 58,
  "Ġ<41>": 59,
  "Ġ<42>": 60,
  "Ġ<43>": 61,
  "Ġ<44>": 62,
  "Ġ<45>": 63,
  "Ġ<46>": 64,
  "Ġ<47>": 65,
  "Ġ<48>": 66,
  "Ġ<49>": 67,
  "Ġ<50>": 68,
  "Ġ<51>": 69,
  "Ġ<52>": 70,
  "Ġ<53>": 71,
  "Ġ<54>": 72,
  "Ġ<55>": 73,
  "Ġ<56>": 74,
  "Ġ<57>": 75,
  "Ġ<58>": 76,
  "Ġ<59>": 77,
  "Ġ<60>": 78,
  "Ġ<61>": 79,
  "Ġ<62>": 80,
  "Ġ<63>": 81,
  "Ġ<64>": 82,
  "Ġ<65>": 83,
  "Ġ<66>": 84,
  "Ġ<67>": 85,
  "Ġ<68>": 86,
  "Ġ<69>": 87,
  "Ġ<70>": 88,
  "Ġ<71>": 89,
  "Ġ<72>": 90,
  "Ġ<73>": 91,
  "Ġ<74>": 92,
  "Ġ<75>": 93,
  "Ġ<76>": 94,
  "Ġ<77>": 95,
  "Ġ<78>": 96,
  "Ġ<79>": 97,
  "Ġ<80>": 98,
  "Ġ<81>": 99,
  "Ġ<82>": 100,
  "Ġ<83>": 101,
  "Ġ<84>": 102,
  "Ġ<85>": 103,
  "Ġ<86>": 104,
  "Ġ<87>": 105,
  "Ġ<88>": 106,
  "Ġ<89>": 107,
  "Ġ<90>": 108,
  "Ġ<91>": 109,
  "Ġ<92>": 110,
  "Ġ<93>": 111,
  "Ġ<94>": 112,
  "Ġ<95>": 113,
  "Ġ<96>": 114,
  "Ġ<97>": 115,
  "Ġ<98>": 116,
  "Ġ<99>": 117,
  "Ġ<100>": 118,
  "Ġ<101>": 119,
  "Ġ<102>": 120,
  "Ġ<103>": 121,
  "Ġ<104>": 122,
  "Ġ<105>": 123,
  "Ġ<106>": 124,
  "Ġ<107>": 125,
  "Ġ<108>": 126,
  "Ġ<109>": 127,
  "Ġ<110>": 128,
  "Ġ<111>": 129,
  "Ġ<112>": 130,
  "Ġ<113>": 131,
  "Ġ<114>": 132,
  "Ġ<115>": 133,
  "Ġ<116>": 134,
  "Ġ<117>": 135,
  "Ġ<118>": 136,
  "Ġ<119>": 137,
  "Ġ<120>": 138,
  "Ġ<121>": 139,
  "Ġ<122>": 140,
  "Ġ<123>": 141,
  "Ġ<124>": 142,
  "Ġ<125>": 143,
  "Ġ<126>": 144,
  "Ġ<127>": 145,
  "Ġ<128>": 146,
  "Ġ<129>": 147,
  "Ġ<130>": 148,
  "Ġ<131>": 149,
  "Ġ<132>": 150,
  "Ġ<133>": 151,
  "Ġ<134>": 152,
  "Ġ<135>": 153,
  "Ġ<136>": 154,
  "Ġ<137>": 155,
  "Ġ<138>": 156,
  "Ġ<139>": 157,
  "Ġ<140>": 158,
  "Ġ<141>": 159,
  "Ġ<142>": 160,
  "Ġ<143>": 161,
  "Ġ<144>": 162,
  "Ġ<145>": 163,
  "Ġ<146>": 164,
  "Ġ<147>": 165,
  "Ġ<148>": 166,
  "Ġ<149>": 167,
  "Ġ<150>": 168,
  "Ġ<151>": 169,
  "Ġ<152>": 170,
  "Ġ<153>": 171,
  "Ġ<154>": 172,
  "Ġ<155>": 173,
  "Ġ<156>": 174,
  "Ġ<157>": 175,
  "Ġ<158>": 176,
  "Ġ<159>": 177,
  "Ġ<160>": 178,
  "Ġ<161>": 179,
  "Ġ<162>": 180,
  "Ġ<163>": 181,
  "Ġ<164>": 182,
  "Ġ<165>": 183,
  "Ġ<166>": 184,
  "Ġ<167>": 185,
  "Ġ<168>": 186,
  "Ġ<169>": 187,
  "Ġ<170>": 188,
  "Ġ<171>": 189,
  "Ġ<172>": 190,
  "Ġ<173>": 191,
  "Ġ<174>": 192,
  "Ġ<175>": 193,
  "Ġ<176>": 194,
  "Ġ<177>": 195,
  "Ġ<178>": 196,
  "Ġ<179>": 197,
  "Ġ<180>": 198,
  "Ġ<181>": 199,
  "Ġ<182>": 200,
  "Ġ<183>": 201,
  "Ġ<184>": 202,
  "Ġ<185>": 203,
  "Ġ<186>": 204,
  "Ġ<187>": 205,
  "Ġ<188>": 206,
  "Ġ<189>": 207,
  "Ġ<190>": 208,
  "Ġ<191>": 209,
  "Ġ<192>": 210,
  "Ġ<193>": 211,
  "Ġ<194>": 212,
  "Ġ<195>": 213,
  "Ġ<196>": 214,
  "Ġ<197>": 215,
  "Ġ<198>": 216,
  "Ġ<199>": 217,
  "Ġ<200>": 218,
  "Ġ<201>": 219,
  "Ġ<202>": 220,
  "Ġ<203>": 221,
  "Ġ<204>": 222,
  "Ġ<205>": 223,
  "Ġ<206>": 224,
  "Ġ<207>": 225,
  "Ġ<208>": 226,
  "Ġ<209>": 227,
  "Ġ<210>": 228,
  "Ġ<211>": 229,
  "Ġ<212>": 230,
  "Ġ<213>": 231,
  "Ġ<214>": 232,
  "Ġ<215>": 233,
  "Ġ<216>": 234,
  "Ġ<217>": 235,
  "Ġ<218>": 236,
  "Ġ<219>": 237,
  "Ġ<220>": 238,
  "Ġ<221>": 239,
  "Ġ<222>": 240,
  "Ġ<223>": 241,
  "Ġ<224>": 242,
  "Ġ<225>": 243,
  "Ġ<226>": 244,
  "Ġ<227>": 245,
  "Ġ<228>": 246,
  "Ġ<229>": 247,
  "Ġ<230>": 248,
  "Ġ<231>": 249,
  "Ġ<232>": 250,
  "Ġ<233>": 251,
  "Ġ<234>": 252,
  "Ġ<235>": 253,
  "Ġ<236>": 254,
  "Ġ<237>": 255,
  "Ġ<238>": 256,
  "Ġ<239>": 257,
  "Ġ<240>": 258,
  "Ġ<241>": 259,
  "Ġ<242>": 260,
  "Ġ<243>": 261,
  "Ġ<244>": 262,
  "Ġ<245>": 263,
  "Ġ<246>": 264,
  "Ġ<247>": 265,
  "Ġ<248>": 266,
  "Ġ<249>": 267,
  "Ġ<250>": 268,
  "Ġ<251>": 269,
  "Ġ<252>": 270,
  "Ġ<253>": 271,
  "Ġ<254>": 272,
  "Ġ<255>": 273,
  "Ġ<256>": 274,
  "Ġ<257>": 275,
  "Ġ<258>": 276,
  "Ġ<259>": 277,
  "Ġ<260>": 278,
  "Ġ<261>": 279,
  "Ġ<262>": 280,
  "Ġ<263>": 281,
  "Ġ<264>": 282,
  "Ġ<265>": 283,
  "Ġ<266>": 284,
  "Ġ<267>": 285,
  "Ġ<268>": 286,
  "Ġ<269>": 287,
  "Ġ<270>": 288,
  "Ġ<271>": 289,
  "Ġ<272>": 290,
  "Ġ<273>": 291,
  "Ġ<274>": 292,
  "Ġ<275>": 293,
  "Ġ<276>": 294,
  "Ġ<277>": 295,
  "Ġ<278>": 296,
  "Ġ<279>": 297,
  "Ġ<280>": 298,
  "Ġ<281>": 299,
  "Ġ<282>": 300,
  "Ġ<283>": 301,
  "Ġ<284>": 302,
  "Ġ<285>": 303,
  "Ġ<286>": 304,
  "Ġ<287>": 305,
  "Ġ<288>": 306,
  "Ġ<289>": 307,
  "Ġ<290>": 308,
  "Ġ<291>": 309,
  "Ġ<292>": 310,
  "Ġ<293>": 311,
  "Ġ<294>": 312,
  "Ġ<295>": 313,
  "Ġ<296>": 314,
  "Ġ<297>": 315,
  "Ġ<298>": 316,
  "Ġ<299>": 317,
  "Ġ<300>": 318,
  "Ġ<301>": 319,
  "Ġ<302>": 320,
  "Ġ<303>": 321,
  "Ġ<304>": 322,
  "Ġ<305>": 323,
  "Ġ<306>": 324,
  "Ġ<307>": 325,
  "Ġ<308>": 326,
  "Ġ<309>": 327,
  "Ġ<310>": 328,
  "Ġ<311>": 329,
  "Ġ<312>": 330,
  "Ġ<313>": 331,
  "Ġ<314>": 332,
  "Ġ<315>": 333,
  "Ġ<316>": 334,
  "Ġ<317>": 335,
  "Ġ<318>": 336,
  "Ġ<319>": 337,
  "Ġ<320>": 338,
  "Ġ<321>": 339,
  "Ġ<322>": 340,
  "Ġ<323>": 341,
  "Ġ<324>": 342,
  "Ġ<325>": 343,
  "Ġ<326>": 344,
  "Ġ<327>": 345,
  "Ġ<328>": 346,
  "Ġ<329>": 347,
  "Ġ<330>": 348,
  "Ġ<331>": 349,
  "Ġ<332>": 350,
  "Ġ<333>": 351,
  "Ġ<334>": 352,
  "Ġ<335>": 353,
  "Ġ<336>": 354,
  "Ġ<337>": 355,
  "Ġ<338>": 356,
  "Ġ<339>": 357,
  "Ġ<340>": 358,
  "Ġ<341>": 359,
  "Ġ<342>": 360,
  "Ġ<343>": 361,
  "Ġ<344>": 362,
  "Ġ<345>": 363,
  "Ġ<346>": 364,
  "Ġ<347>": 365,
  "Ġ<348>": 366,
  "Ġ<349>": 367,
  "Ġ<350>": 368,
  "Ġ<351>": 369,
  "Ġ<352>": 370,
  "Ġ<353>": 371,
  "Ġ<354>": 372,
  "Ġ<355>": 373,
  "Ġ<356>": 374,
  "Ġ<357>": 375,
  "Ġ<358>": 376,
  "Ġ<359>": 377,
  "Ġ<360>": 378,
  "Ġ<361>": 379,
  "Ġ<362>": 380,
  "Ġ<363>": 381,
  "Ġ<364>": 382,
  "Ġ<365>": 383,
  "Ġ<366>": 384,
  "Ġ<367>": 385,
  "Ġ<368>": 386,
  "Ġ<369>": 387,
  "Ġ<370>": 388,
  "Ġ<371>": 389,
  "Ġ<372>": 390,
  "Ġ<373>": 391,
  "Ġ<374>": 392,
  "Ġ<375>": 393,
  "Ġ<376>": 394,
  "Ġ<377>": 395,
  "Ġ<378>": 396,
  "Ġ<379>": 397,
  "Ġ<380>": 398,
  "Ġ<381>": 399,
  "Ġ<382>": 400,
  "Ġ<383>": 401,
  "Ġ<384>": 402,
  "Ġ<385>": 403,
  "Ġ<386>": 404,
  "Ġ<387>": 405,
  "Ġ<388>": 406,
  "Ġ<389>": 407,
  "Ġ<390>": 408,
  "Ġ<391>": 409,
  "Ġ<392>": 410,
  "Ġ<393>": 411,
  "Ġ<394>": 412,
  "Ġ<395>": 413,
  "Ġ<396>": 414,
  "Ġ<397>": 415,
  "Ġ<398>": 416,
  "Ġ<399>": 417
}