{
  "<|padding|>": 0,
  "<|endoftext|>": 1,
  "<|unk|>": 2,
  "Ġinit": 3,
  "Ġoperation": 4,
  "Ġswap": 5,
  "Ġwrite": 6,
  "Ġend": 7,
  "Ġload": 8,
  "Ġline": 9,
  "Ġtape": 10,
  "Ġ.": 11,
  "Ġ(": 12,
  "Ġ)": 13,
  "Ġ[": 14,
  "Ġ]": 15,
  "Ġ,": 16,
  "Ġtrue": 17,
  "Ġfalse": 18,
  "Ġ∧": 19,
  "Ġ∨": 20,
  "Ġ¬": 21,
  "ĠT": 22,
  "ĠF": 23,
  "Ġ<|trace|>": 24,
  "Ġanswer": 25,
  "Ġ<0>": 26,
  "Ġ<1>": 27,
  "Ġ<2>": 28,
  "Ġ<3>": 29,
  "Ġ<4>": 30,
  "Ġ<5>": 31,
  "Ġ<6>": 32,
  "Ġ<7>": 33,
  "Ġ<8>": 34,
  "Ġ<9>": 35,
  "Ġ<10>": 36,
  "Ġ<11>": 37,
  "Ġ<12>": 38,
  "Ġ<13>": 39,
  "Ġ<14>": 40,
  "Ġ<15>": 41,
  "Ġ<16>": 42,
  "Ġ<17>": 43,
  "Ġ<18>": 44,
  "Ġ<19>": 45,
  "Ġ<20>": 46,
  "Ġ<21>": 47,
  "Ġ<22>": 48,
  "Ġ<23>": 49,
  "Ġ<24>": 50,
  "Ġ<25>": 51,
  "Ġ<26>": 52,
  "Ġ<27>": 53,
  "Ġ<28>": 54,
  "Ġ<29>": 55,
  "Ġ<30>": 56,
  "Ġ<31>": 57,
  "Ġ<32>": 58,
  "Ġ<33>": 59,
  "Ġ<34>": 60,
  "Ġ<35>": 61,
  "Ġ<36>": 62,
  "Ġ<37>": 63,
  "Ġ<38>": 64,
  "Ġ<39>": 65,
  "Ġ<40>": 66,
  "Ġ<41>": 67,
  "Ġ<42>": 68,
  "Ġ<43>": 69,
  "Ġ<44>": 70,
  "Ġ<45>": 71,
  "Ġ<46>": 72,
  "Ġ<47>": 73,
  "Ġ<48>": 74,
  "Ġ<49>": 75,
  "Ġ<50>": 76,
  "Ġ<51>": 77,
  "Ġ<52>": 78,
  "Ġ<53>": 79,
  "Ġ<54>": 80,
  "Ġ<55>": 81,
  "Ġ<56>": 82,
  "Ġ<57>": 83,
  "Ġ<58>": 84,
  "Ġ<59>": 85,
  "Ġ<60>": 86,
  "Ġ<61>": 87,
  "Ġ<62>": 88,
  "Ġ<63>": 89,
  "Ġ<64>": 90,
  "Ġ<65>": 91,
  "Ġ<66>": 92,
  "Ġ<67>": 93,
  "Ġ<68>": 94,
  "Ġ<69>": 95,
  "Ġ<70>": 96,
  "Ġ<71>": 97,
  "Ġ<72>": 98,
  "Ġ<73>": 99,
  "Ġ<74>": 100,
  "Ġ<75>": 101,
  "Ġ<76>": 102,
  "Ġ<77>": 103,
  "Ġ<78>": 104,
  "Ġ<79>": 105,
  "Ġ<80>": 106,
  "Ġ<81>": 107,
  "Ġ<82>": 108,
  "Ġ<83>": 109,
  "Ġ<84>": 110,
  "Ġ<85>": 111,
  "Ġ<86>": 112,
  "Ġ<87>": 113,
  "Ġ<88>": 114,
  "Ġ<89>": 115,
  "Ġ<90>": 116,
  "Ġ<91>": 117,
  "Ġ<92>": 118,
  "Ġ<93>": 119,
  "Ġ<94>": 120,
  "Ġ<95>": 121,
  "Ġ<96>": 122,
  "Ġ<97>": 123,
  "Ġ<98>": 124,
  "Ġ<99>": 125,
  "Ġ<100>": 126,
  "Ġ<101>": 127,
  "Ġ<102>": 128,
  "Ġ<103>": 129,
  "Ġ<104>": 130,
  "Ġ<105>": 131,
  "Ġ<106>": 132,
  "Ġ<107>": 133,
  "Ġ<108>": 134,
  "Ġ<109>": 135,
  "Ġ<110>": 136,
  "Ġ<111>": 137,
  "Ġ<112>": 138,
  "Ġ<113>": 139,
  "Ġ<114>": 140,
  "Ġ<115>": 141,
  "Ġ<116>": 142,
  "Ġ<117>": 143,
  "Ġ<118>": 144,
  "Ġ<119>": 145,
  "Ġ<120>": 146,
  "Ġ<121>": 147,
  "Ġ<122>": 148,
  "Ġ<123>": 149,
  "Ġ<124>": 150,
  "Ġ<125>": 151,
  "Ġ<126>": 152,
  "Ġ<127>": 153,
  "Ġ<128>": 154,
  "Ġ<129>": 155,
  "Ġ<130>": 156,
  "Ġ<131>": 157,
  "Ġ<132>": 158,
  "Ġ<133>": 159,
  "Ġ<134>": 160,
  "Ġ<135>": 161,
  "Ġ<136>": 162,
  "Ġ<137>": 163,
  "Ġ<138>": 164,
  "Ġ<139>": 165,
  "Ġ<140>": 166,
  "Ġ<141>": 167,
  "Ġ<142>": 168,
  "Ġ<143>": 169,
  "Ġ<144>": 170,
  "Ġ<145>": 171,
  "Ġ<146>": 172,
  "Ġ<147>": 173,
  "Ġ<148>": 174,
  "Ġ<149>": 175,
  "Ġ<150>": 176,
  "Ġ<151>": 177,
  "Ġ<152>": 178,
  "Ġ<153>": 179,
  "Ġ<154>": 180,
  "Ġ<155>": 181,
  "Ġ<156>": 182,
  "Ġ<157>": 183,
  "Ġ<158>": 184,
  "Ġ<159>": 185,
  "Ġ<160>": 186,
  "Ġ<161>": 187,
  "Ġ<162>": 188,
  "Ġ<163>": 189,
  "Ġ<164>": 190,
  "Ġ<165>": 191,
  "Ġ<166>": 192,
  "Ġ<167>": 193,
  "Ġ<168>": 194,
  "Ġ<169>": 195,
  "Ġ<170>": 196,
  "Ġ<171>": 197,
  "Ġ<172>": 198,
  "Ġ<173>": 199,
  "Ġ<174>": 200,
  "Ġ<175>": 201,
  "Ġ<176>": 202,
  "Ġ<177>": 203,
  "Ġ<178>": 204,
  "Ġ<179>": 205,
  "Ġ<180>": 206,
  "Ġ<181>": 207,
  "Ġ<182>": 208,
  "Ġ<183>": 209,
  "Ġ<184>": 210,
  "Ġ<185>": 211,
  "Ġ<186>": 212,
  "Ġ<187>": 213,
  "Ġ<188>": 214,
  "Ġ<189>": 215,
  "Ġ<190>": 216,
  "Ġ<191>": 217,
  "Ġ<192>": 218,
  "Ġ<193>": 219,
  "Ġ<194>": 220,
  "Ġ<195>": 221,
  "Ġ<196>": 222,
  "Ġ<197>": 223,
  "Ġ<198>": 224,
  "Ġ<199>": 225,
  "Ġ<200>": 226,
  "Ġ<201>": 227,
  "Ġ<202>": 228,
  "Ġ<203>": 229,
  "Ġ<204>": 230,
  "Ġ<205>": 231,
  "Ġ<206>": 232,
  "Ġ<207>": 233,
  "Ġ<208>": 234,
  "Ġ<209>": 235,
  "Ġ<210>": 236,
  "Ġ<211>": 237,
  "Ġ<212>": 238,
  "Ġ<213>": 239,
  "Ġ<214>": 240,
  "Ġ<215>": 241,
  "Ġ<216>": 242,
  "Ġ<217>": 243,
  "Ġ<218>": 244,
  "Ġ<219>": 245,
  "Ġ<220>": 246,
  "Ġ<221>": 247,
  "Ġ<222>": 248,
  "Ġ<223>": 249,
  "Ġ<224>": 250,
  "Ġ<225>": 251,
  "Ġ<226>": 252,
  "Ġ<227>": 253,
  "Ġ<228>": 254,
  "Ġ<229>": 255,
  "Ġ<230>": 256,
  "Ġ<231>": 257,
  "Ġ<232>": 258,
  "Ġ<233>": 259,
  "Ġ<234>": 260,
  "Ġ<235>": 261,
  "Ġ<236>": 262,
  "Ġ<237>": 263,
  "Ġ<238>": 264,
  "Ġ<239>": 265,
  "Ġ<240>": 266,
  "Ġ<241>": 267,
  "Ġ<242>": 268,
  "Ġ<243>": 269,
  "Ġ<244>": 270,
  "Ġ<245>": 271,
  "Ġ<246>": 272,
  "Ġ<247>": 273,
  "Ġ<248>": 274,
  "Ġ<249>": 275,
  "Ġ<250>": 276,
  "Ġ<251>": 277,
  "Ġ<252>": 278,
  "Ġ<253>": 279,
  "Ġ<254>": 280,
  "Ġ<255>": 281,
  "Ġ<256>": 282,
  "Ġ<257>": 283,
  "Ġ<258>": 284,
  "Ġ<259>": 285,
  "Ġ<260>": 286,
  "Ġ<261>": 287,
  "Ġ<262>": 288,
  "Ġ<263>": 289,
  "Ġ<264>": 290,
  "Ġ<265>": 291,
  "Ġ<266>": 292,
  "Ġ<267>": 293,
  "Ġ<268>": 294,
  "Ġ<269>": 295,
  "Ġ<270>": 296,
  "Ġ<271>": 297,
  "Ġ<272>": 298,
  "Ġ<273>": 299,
  "Ġ<274>": 300,
  "Ġ<275>": 301,
  "Ġ<276>": 302,
  "Ġ<277>": 303,
  "Ġ<278>": 304,
  "Ġ<279>": 305,
  "Ġ<280>": 306,
  "Ġ<281>": 307,
  "Ġ<282>": 308,
  "Ġ<283>": 309,
  "Ġ<284>": 310,
  "Ġ<285>": 311,
  "Ġ<286>": 312,
  "Ġ<287>": 313,
  "Ġ<288>": 314,
  "Ġ<289>": 315,
  "Ġ<290>": 316,
  "Ġ<291>": 317,
  "Ġ<292>": 318,
  "Ġ<293>": 319,
  "Ġ<294>": 320,
  "Ġ<295>": 321,
  "Ġ<296>": 322,
  "Ġ<297>": 323,
  "Ġ<298>": 324,
  "Ġ<299>": 325,
  "Ġ<300>": 326,
  "Ġ<301>": 327,
  "Ġ<302>": 328,
  "Ġ<303>": 329,
  "Ġ<304>": 330,
  "Ġ<305>": 331,
  "Ġ<306>": 332,
  "Ġ<307>": 333,
  "Ġ<308>": 334,
  "Ġ<309>": 335,
  "Ġ<310>": 336,
  "Ġ<311>": 337,
  "Ġ<312>": 338,
  "Ġ<313>": 339,
  "Ġ<314>": 340,
  "Ġ<315>": 341,
  "Ġ<316>": 342,
  "Ġ<317>": 343,
  "Ġ<318>": 344,
  "Ġ<319>": 345,
  "Ġ<320>": 346,
  "Ġ<321>": 347,
  "Ġ<322>": 348,
  "Ġ<323>": 349,
  "Ġ<324>": 350,
  "Ġ<325>": 351,
  "Ġ<326>": 352,
  "Ġ<327>": 353,
  "Ġ<328>": 354,
  "Ġ<329>": 355,
  "Ġ<330>": 356,
  "Ġ<331>": 357,
  "Ġ<332>": 358,
  "Ġ<333>": 359,
  "Ġ<334>": 360,
  "Ġ<335>": 361,
  "Ġ<336>": 362,
  "Ġ<337>": 363,
  "Ġ<338>": 364,
  "Ġ<339>": 365,
  "Ġ<340>": 366,
  "Ġ<341>": 367,
  "Ġ<342>": 368,
  "Ġ<343>": 369,
  "Ġ<344>": 370,
  "Ġ<345>": 371,
  "Ġ<346>": 372,
  "Ġ<347>": 373,
  "Ġ<348>": 374,
  "Ġ<349>": 375,
  "Ġ<350>": 376,
  "Ġ<351>": 377,
  "Ġ<352>": 378,
  "Ġ<353>": 379,
  "Ġ<354>": 380,
  "Ġ<355>": 381,
  "Ġ<356>": 382,
  "Ġ<357>": 383,
  "Ġ<358>": 384,
  "Ġ<359>": 385,
  "Ġ<360>": 386,
  "Ġ<361>": 387,
  "Ġ<362>": 388,
  "Ġ<363>": 389,
  "Ġ<364>": 390,
  "Ġ<365>": 391,
  "Ġ<366>": 392,
  "Ġ<367>": 393,
  "Ġ<368>": 394,
  "Ġ<369>": 395,
  "Ġ<370>": 396,
  "Ġ<371>": 397,
  "Ġ<372>": 398,
  "Ġ<373>": 399,
  "Ġ<374>": 400,
  "Ġ<375>": 401,
  "Ġ<376>": 402,
  "Ġ<377>": 403,
  "Ġ<378>": 404,
  "Ġ<379>": 405,
  "Ġ<380>": 406,
  "Ġ<381>": 407,
  "Ġ<382>": 408,
  "Ġ<383>": 409,
  "Ġ<384>": 410,
  "Ġ<385>": 411,
  "Ġ<386>": 412,
  "Ġ<387>": 413,
  "Ġ<388>": 414,
  "Ġ<389>": 415,
  "Ġ<390>": 416,
  "Ġ<391>": 417,
  "Ġ<392>": 418,
  "Ġ<393>": 419,
  "Ġ<394>": 420,
  "Ġ<395>": 421,
  "Ġ<396>": 422,
  "Ġ<397>": 423,
  "Ġ<398>": 424,
  "Ġ<399>": 425
}