{
  "<|padding|>": 0,
  "<|endoftext|>": 1,
  "<|unk|>": 2,
  "Ġinit": 3,
  "Ġoperation": 4,
  "Ġswap": 5,
  "Ġwrite": 6,
  "Ġend": 7,
  "Ġload": 8,
  "Ġline": 9,
  "Ġtape": 10,
  "Ġ.": 11,
  "ĠCat": 12,
  "ĠDog": 13,
  "ĠApple": 14,
  "ĠBook": 15,
  "ĠHat": 16,
  "ĠA": 17,
  "ĠB": 18,
  "ĠC": 19,
  "ĠD": 20,
  "ĠE": 21,
  "Ġ<|trace|>": 22,
  "Ġanswer": 23,
  "Ġ<0>": 24,
  "Ġ<1>": 25,
  "Ġ<2>": 26,
  "Ġ<3>": 27,
  "Ġ<4>": 28,
  "Ġ<5>": 29,
  "Ġ<6>": 30,
  "Ġ<7>": 31,
  "Ġ<8>": 32,
  "Ġ<9>": 33,
  "Ġ<10>": 34,
  "Ġ<11>": 35,
  "Ġ<12>": 36,
  "Ġ<13>": 37,
  "Ġ<14>": 38,
  "Ġ<15>": 39,
  "Ġ<16>": 40,
  "Ġ<17>": 41,
  "Ġ<18>": 42,
  "Ġ<19>": 43,
  "Ġ<20>": 44,
  "Ġ<21>": 45,
  "Ġ<22>": 46,
  "Ġ<23>": 47,
  "Ġ<24>": 48,
  "Ġ<25>": 49,
  "Ġ<26>": 50,
  "Ġ<27>": 51,
  "Ġ<28>": 52,
  "Ġ<29>": 53,
  "Ġ<30>": 54,
  "Ġ<31>": 55,
  "Ġ<32>": 56,
  "Ġ<33>": 57,
  "Ġ<34>": 58,
  "Ġ<35>": 59,
  "Ġ<36>": 60,
  "Ġ<37>": 61,
  "Ġ<38>": 62,
  "Ġ<39>": 63,
  "Ġ<40>": 64,
  "Ġ<41>": 65,
  "Ġ<42>": 66,
  "Ġ<43>": 67,
  "Ġ<44>": 68,
  "Ġ<45>": 69,
  "Ġ<46>": 70,
  "Ġ<47>": 71,
  "Ġ<48>": 72,
  "Ġ<49>": 73,
  "Ġ<50>": 74,
  "Ġ<51>": 75,
  "Ġ<52>": 76,
  "Ġ<53>": 77,
  "Ġ<54>": 78,
  "Ġ<55>": 79,
  "Ġ<56>": 80,
  "Ġ<57>": 81,
  "Ġ<58>": 82,
  "Ġ<59>": 83,
  "Ġ<60>": 84,
  "Ġ<61>": 85,
  "Ġ<62>": 86,
  "Ġ<63>": 87,
  "Ġ<64>": 88,
  "Ġ<65>": 89,
  "Ġ<66>": 90,
  "Ġ<67>": 91,
  "Ġ<68>": 92,
  "Ġ<69>": 93,
  "Ġ<70>": 94,
  "Ġ<71>": 95,
  "Ġ<72>": 96,
  "Ġ<73>": 97,
  "Ġ<74>": 98,
  "Ġ<75>": 99,
  "Ġ<76>": 100,
  "Ġ<77>": 101,
  "Ġ<78>": 102,
  "Ġ<79>": 103,
  "Ġ<80>": 104,
  "Ġ<81>": 105,
  "Ġ<82>": 106,
  "Ġ<83>": 107,
  "Ġ<84>": 108,
  "Ġ<85>": 109,
  "Ġ<86>": 110,
  "Ġ<87>": 111,
  "Ġ<88>": 112,
  "Ġ<89>": 113,
  "Ġ<90>": 114,
  "Ġ<91>": 115,
  "Ġ<92>": 116,
  "Ġ<93>": 117,
  "Ġ<94>": 118,
  "Ġ<95>": 119,
  "Ġ<96>": 120,
  "Ġ<97>": 121,
  "Ġ<98>": 122,
  "Ġ<99>": 123,
  "Ġ<100>": 124,
  "Ġ<101>": 125,
  "Ġ<102>": 126,
  "Ġ<103>": 127,
  "Ġ<104>": 128,
  "Ġ<105>": 129,
  "Ġ<106>": 130,
  "Ġ<107>": 131,
  "Ġ<108>": 132,
  "Ġ<109>": 133,
  "Ġ<110>": 134,
  "Ġ<111>": 135,
  "Ġ<112>": 136,
  "Ġ<113>": 137,
  "Ġ<114>": 138,
  "Ġ<115>": 139,
  "Ġ<116>": 140,
  "Ġ<117>": 141,
  "Ġ<118>": 142,
  "Ġ<119>": 143,
  "Ġ<120>": 144,
  "Ġ<121>": 145,
  "Ġ<122>": 146,
  "Ġ<123>": 147,
  "Ġ<124>": 148,
  "Ġ<125>": 149,
  "Ġ<126>": 150,
  "Ġ<127>": 151,
  "Ġ<128>": 152,
  "Ġ<129>": 153,
  "Ġ<130>": 154,
  "Ġ<131>": 155,
  "Ġ<132>": 156,
  "Ġ<133>": 157,
  "Ġ<134>": 158,
  "Ġ<135>": 159,
  "Ġ<136>": 160,
  "Ġ<137>": 161,
  "Ġ<138>": 162,
  "Ġ<139>": 163,
  "Ġ<140>": 164,
  "Ġ<141>": 165,
  "Ġ<142>": 166,
  "Ġ<143>": 167,
  "Ġ<144>": 168,
  "Ġ<145>": 169,
  "Ġ<146>": 170,
  "Ġ<147>": 171,
  "Ġ<148>": 172,
  "Ġ<149>": 173,
  "Ġ<150>": 174,
  "Ġ<151>": 175,
  "Ġ<152>": 176,
  "Ġ<153>": 177,
  "Ġ<154>": 178,
  "Ġ<155>": 179,
  "Ġ<156>": 180,
  "Ġ<157>": 181,
  "Ġ<158>": 182,
  "Ġ<159>": 183,
  "Ġ<160>": 184,
  "Ġ<161>": 185,
  "Ġ<162>": 186,
  "Ġ<163>": 187,
  "Ġ<164>": 188,
  "Ġ<165>": 189,
  "Ġ<166>": 190,
  "Ġ<167>": 191,
  "Ġ<168>": 192,
  "Ġ<169>": 193,
  "Ġ<170>": 194,
  "Ġ<171>": 195,
  "Ġ<172>": 196,
  "Ġ<173>": 197,
  "Ġ<174>": 198,
  "Ġ<175>": 199,
  "Ġ<176>": 200,
  "Ġ<177>": 201,
  "Ġ<178>": 202,
  "Ġ<179>": 203,
  "Ġ<180>": 204,
  "Ġ<181>": 205,
  "Ġ<182>": 206,
  "Ġ<183>": 207,
  "Ġ<184>": 208,
  "Ġ<185>": 209,
  "Ġ<186>": 210,
  "Ġ<187>": 211,
  "Ġ<188>": 212,
  "Ġ<189>": 213,
  "Ġ<190>": 214,
  "Ġ<191>": 215,
  "Ġ<192>": 216,
  "Ġ<193>": 217,
  "Ġ<194>": 218,
  "Ġ<195>": 219,
  "Ġ<196>": 220,
  "Ġ<197>": 221,
  "Ġ<198>": 222,
  "Ġ<199>": 223,
  "Ġ<200>": 224,
  "Ġ<201>": 225,
  "Ġ<202>": 226,
  "Ġ<203>": 227,
  "Ġ<204>": 228,
  "Ġ<205>": 229,
  "Ġ<206>": 230,
  "Ġ<207>": 231,
  "Ġ<208>": 232,
  "Ġ<209>": 233,
  "Ġ<210>": 234,
  "Ġ<211>": 235,
  "Ġ<212>": 236,
  "Ġ<213>": 237,
  "Ġ<214>": 238,
  "Ġ<215>": 239,
  "Ġ<216>": 240,
  "Ġ<217>": 241,
  "Ġ<218>": 242,
  "Ġ<219>": 243,
  "Ġ<220>": 244,
  "Ġ<221>": 245,
  "Ġ<222>": 246,
  "Ġ<223>": 247,
  "Ġ<224>": 248,
  "Ġ<225>": 249,
  "Ġ<226>": 250,
  "Ġ<227>": 251,
  "Ġ<228>": 252,
  "Ġ<229>": 253,
  "Ġ<230>": 254,
  "Ġ<231>": 255,
  "Ġ<232>": 256,
  "Ġ<233>": 257,
  "Ġ<234>": 258,
  "Ġ<235>": 259,
  "Ġ<236>": 260,
  "Ġ<237>": 261,
  "Ġ<238>": 262,
  "Ġ<239>": 263,
  "Ġ<240>": 264,
  "Ġ<241>": 265,
  "Ġ<242>": 266,
  "Ġ<243>": 267,
  "Ġ<244>": 268,
  "Ġ<245>": 269,
  "Ġ<246>": 270,
  "Ġ<247>": 271,
  "Ġ<248>": 272,
  "Ġ<249>": 273,
  "Ġ<250>": 274,
  "Ġ<251>": 275,
  "Ġ<252>": 276,
  "Ġ<253>": 277,
  "Ġ<254>": 278,
  "Ġ<255>": 279,
  "Ġ<256>": 280,
  "Ġ<257>": 281,
  "Ġ<258>": 282,
  "Ġ<259>": 283,
  "Ġ<260>": 284,
  "Ġ<261>": 285,
  "Ġ<262>": 286,
  "Ġ<263>": 287,
  "Ġ<264>": 288,
  "Ġ<265>": 289,
  "Ġ<266>": 290,
  "Ġ<267>": 291,
  "Ġ<268>": 292,
  "Ġ<269>": 293,
  "Ġ<270>": 294,
  "Ġ<271>": 295,
  "Ġ<272>": 296,
  "Ġ<273>": 297,
  "Ġ<274>": 298,
  "Ġ<275>": 299,
  "Ġ<276>": 300,
  "Ġ<277>": 301,
  "Ġ<278>": 302,
  "Ġ<279>": 303,
  "Ġ<280>": 304,
  "Ġ<281>": 305,
  "Ġ<282>": 306,
  "Ġ<283>": 307,
  "Ġ<284>": 308,
  "Ġ<285>": 309,
  "Ġ<286>": 310,
  "Ġ<287>": 311,
  "Ġ<288>": 312,
  "Ġ<289>": 313,
  "Ġ<290>": 314,
  "Ġ<291>": 315,
  "Ġ<292>": 316,
  "Ġ<293>": 317,
  "Ġ<294>": 318,
  "Ġ<295>": 319,
  "Ġ<296>": 320,
  "Ġ<297>": 321,
  "Ġ<298>": 322,
  "Ġ<299>": 323,
  "Ġ<300>": 324,
  "Ġ<301>": 325,
  "Ġ<302>": 326,
  "Ġ<303>": 327,
  "Ġ<304>": 328,
  "Ġ<305>": 329,
  "Ġ<306>": 330,
  "Ġ<307>": 331,
  "Ġ<308>": 332,
  "Ġ<309>": 333,
  "Ġ<310>": 334,
  "Ġ<311>": 335,
  "Ġ<312>": 336,
  "Ġ<313>": 337,
  "Ġ<314>": 338,
  "Ġ<315>": 339,
  "Ġ<316>": 340,
  "Ġ<317>": 341,
  "Ġ<318>": 342,
  "Ġ<319>": 343,
  "Ġ<320>": 344,
  "Ġ<321>": 345,
  "Ġ<322>": 346,
  "Ġ<323>": 347,
  "Ġ<324>": 348,
  "Ġ<325>": 349,
  "Ġ<326>": 350,
  "Ġ<327>": 351,
  "Ġ<328>": 352,
  "Ġ<329>": 353,
  "Ġ<330>": 354,
  "Ġ<331>": 355,
  "Ġ<332>": 356,
  "Ġ<333>": 357,
  "Ġ<334>": 358,
  "Ġ<335>": 359,
  "Ġ<336>": 360,
  "Ġ<337>": 361,
  "Ġ<338>": 362,
  "Ġ<339>": 363,
  "Ġ<340>": 364,
  "Ġ<341>": 365,
  "Ġ<342>": 366,
  "Ġ<343>": 367,
  "Ġ<344>": 368,
  "Ġ<345>": 369,
  "Ġ<346>": 370,
  "Ġ<347>": 371,
  "Ġ<348>": 372,
  "Ġ<349>": 373,
  "Ġ<350>": 374,
  "Ġ<351>": 375,
  "Ġ<352>": 376,
  "Ġ<353>": 377,
  "Ġ<354>": 378,
  "Ġ<355>": 379,
  "Ġ<356>": 380,
  "Ġ<357>": 381,
  "Ġ<358>": 382,
  "Ġ<359>": 383,
  "Ġ<360>": 384,
  "Ġ<361>": 385,
  "Ġ<362>": 386,
  "Ġ<363>": 387,
  "Ġ<364>": 388,
  "Ġ<365>": 389,
  "Ġ<366>": 390,
  "Ġ<367>": 391,
  "Ġ<368>": 392,
  "Ġ<369>": 393,
  "Ġ<370>": 394,
  "Ġ<371>": 395,
  "Ġ<372>": 396,
  "Ġ<373>": 397,
  "Ġ<374>": 398,
  "Ġ<375>": 399,
  "Ġ<376>": 400,
  "Ġ<377>": 401,
  "Ġ<378>": 402,
  "Ġ<379>": 403,
  "Ġ<380>": 404,
  "Ġ<381>": 405,
  "Ġ<382>": 406,
  "Ġ<383>": 407,
  "Ġ<384>": 408,
  "Ġ<385>": 409,
  "Ġ<386>": 410,
  "Ġ<387>": 411,
  "Ġ<388>": 412,
  "Ġ<389>": 413,
  "Ġ<390>": 414,
  "Ġ<391>": 415,
  "Ġ<392>": 416,
  "Ġ<393>": 417,
  "Ġ<394>": 418,
  "Ġ<395>": 419,
  "Ġ<396>": 420,
  "Ġ<397>": 421,
  "Ġ<398>": 422,
  "Ġ<399>": 423,
  "ĠMon": 424,
  "key": 425,
  "ĠDra": 426,
  "gon": 427,
  "ĠSpi": 428,
  "der": 429,
  "ĠArma": 430,
  "dillo": 431,
  "ĠSala": 432,
  "man": 433,
  "ĠAll": 434,
  "iga": 435,
  "tor": 436,
  "ĠBut": 437,
  "ter": 438,
  "fly": 439
}